---
kind: property
id: P:Autodesk.Revit.DB.BaseImportOptions.ThisViewOnly
source: html/99153f1b-01e3-441c-87ea-f2e08afaab0d.htm
---
# Autodesk.Revit.DB.BaseImportOptions.ThisViewOnly Property

Imports drawings into the view that was passed into the import method.
 This option is not available in 3D views.

## Syntax (C#)
```csharp
public bool ThisViewOnly { get; set; }
```